GreatCowBASIC/DATFileGenerator/incfiles/p18F25Q71.inc
;----- OPA1CON4 Bits -----------------------------------------------------
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OFCST            EQU  H'0002'
PTRES            EQU  H'0004'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA1OFCSEL0      EQU  H'0000'
OPA1OFCSEL1      EQU  H'0001'
OPA1OFCST        EQU  H'0002'
OPA1PTRES        EQU  H'0004'
OPA1OFCSEL0      EQU  H'0000'
OPA1OFCSEL1      EQU  H'0001'


;----- OPA1HWC Bits -----------------------------------------------------
HWCL0            EQU  H'0000'
HWCL1            EQU  H'0001'
HWCL2            EQU  H'0002'
ORPOL            EQU  H'0003'
HWCH0            EQU  H'0004'
HWCH1            EQU  H'0005'
HWCH2            EQU  H'0006'
OREN             EQU  H'0007'
HWCL0            EQU  H'0000'
HWCL1            EQU  H'0001'
HWCL2            EQU  H'0002'
HWCH0            EQU  H'0004'
HWCH1            EQU  H'0005'
HWCH2            EQU  H'0006'
OPA1HWCL0        EQU  H'0000'
OPA1HWCL1        EQU  H'0001'
OPA1HWCL2        EQU  H'0002'
OPA1ORPOL        EQU  H'0003'
OPA1HWCH0        EQU  H'0004'
OPA1HWCH1        EQU  H'0005'
OPA1HWCH2        EQU  H'0006'
OPA1OREN         EQU  H'0007'
OPA1HWCL0        EQU  H'0000'
OPA1HWCL1        EQU  H'0001'
OPA1HWCL2        EQU  H'0002'
OPA1HWCH0        EQU  H'0004'
OPA1HWCH1        EQU  H'0005'
OPA1HWCH2        EQU  H'0006'


;----- OPA1OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA1OFFSET0      EQU  H'0000'
OPA1OFFSET1      EQU  H'0001'
OPA1OFFSET2      EQU  H'0002'
OPA1OFFSET3      EQU  H'0003'
OPA1OFFSET4      EQU  H'0004'
OPA1OFFSET5      EQU  H'0005'
OPA1OFFSET6      EQU  H'0006'
OPA1OFFSET7      EQU  H'0007'


;----- OPA1ORS Bits -----------------------------------------------------
ORS0             EQU  H'0000'
ORS1             EQU  H'0001'
ORS2             EQU  H'0002'
ORS3             EQU  H'0003'
ORS4             EQU  H'0004'
OPA1ORS0         EQU  H'0000'
OPA1ORS1         EQU  H'0001'
OPA1ORS2         EQU  H'0002'
OPA1ORS3         EQU  H'0003'
OPA1ORS4         EQU  H'0004'


;----- APMSTART1 Bits -----------------------------------------------------


;----- APMSTART1H Bits -----------------------------------------------------


;----- APMPERS1 Bits -----------------------------------------------------
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMPERS1_2       EQU  H'0002'
APMPERS1_3       EQU  H'0003'
APMPERS1_4       EQU  H'0004'
APMPERS1_5       EQU  H'0005'
APMPERS1_6       EQU  H'0006'
APMPERS1_7       EQU  H'0007'


;----- APMPERS1H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
DAC3             EQU  H'0004'
CMP1             EQU  H'0005'
CMP2             EQU  H'0006'
ZCD              EQU  H'0007'
APMPERS1_8       EQU  H'0000'
APMPERS1_9       EQU  H'0001'
APMPERS1_10      EQU  H'0002'
APMPERS1_11      EQU  H'0003'
APMPERS1_12      EQU  H'0004'
APMPERS1_13      EQU  H'0005'
APMPERS1_14      EQU  H'0006'
APMPERS1_15      EQU  H'0007'


;----- APMEND1 Bits -----------------------------------------------------


;----- APMEND1H Bits -----------------------------------------------------


;----- APMEND1U Bits -----------------------------------------------------


;----- APMPERE1 Bits -----------------------------------------------------
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMPERE1_2       EQU  H'0002'
APMPERE1_3       EQU  H'0003'
APMPERE1_4       EQU  H'0004'
APMPERE1_5       EQU  H'0005'
APMPERE1_6       EQU  H'0006'
APMPERE1_7       EQU  H'0007'


;----- APMPERE1H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
DAC3             EQU  H'0004'
CMP1             EQU  H'0005'
CMP2             EQU  H'0006'
ZCD              EQU  H'0007'
APMPERE1_8       EQU  H'0000'
APMPERE1_9       EQU  H'0001'
APMPERE1_10      EQU  H'0002'
APMPERE1_11      EQU  H'0003'
APMPERE1_12      EQU  H'0004'
APMPERE1_13      EQU  H'0005'
APMPERE1_14      EQU  H'0006'
APMPERE1_15      EQU  H'0007'


;----- RA1PPS Bits -----------------------------------------------------
RA1PPS0          EQU  H'0000'
RA1PPS1          EQU  H'0001'
RA1PPS2          EQU  H'0002'
RA1PPS3          EQU  H'0003'
RA1PPS4          EQU  H'0004'
RA1PPS5          EQU  H'0005'


;----- RB1PPS Bits -----------------------------------------------------
RB1PPS0          EQU  H'0000'
RB1PPS1          EQU  H'0001'
RB1PPS2          EQU  H'0002'
RB1PPS3          EQU  H'0003'
RB1PPS4          EQU  H'0004'
RB1PPS5          EQU  H'0005'


;----- RC1PPS Bits -----------------------------------------------------
RC1PPS0          EQU  H'0000'
RC1PPS1          EQU  H'0001'
RC1PPS2          EQU  H'0002'
RC1PPS3          EQU  H'0003'
RC1PPS4          EQU  H'0004'
RC1PPS5          EQU  H'0005'


;----- INT1PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
INT1PPS0         EQU  H'0000'
INT1PPS1         EQU  H'0001'
INT1PPS2         EQU  H'0002'
INT1PPS3         EQU  H'0003'
INT1PPS4         EQU  H'0004'
INT1PPS5         EQU  H'0005'
INT1PPS0         EQU  H'0000'
INT1PPS1         EQU  H'0001'
INT1PPS2         EQU  H'0002'
INT1PPS3         EQU  H'0003'
INT1PPS4         EQU  H'0004'
INT1PPS5         EQU  H'0005'


;----- T1CKIPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
T1CKIPPS0        EQU  H'0000'
T1CKIPPS1        EQU  H'0001'
T1CKIPPS2        EQU  H'0002'
T1CKIPPS3        EQU  H'0003'
T1CKIPPS4        EQU  H'0004'
T1CKIPPS5        EQU  H'0005'
T1CKIPPS0        EQU  H'0000'
T1CKIPPS1        EQU  H'0001'
T1CKIPPS2        EQU  H'0002'
T1CKIPPS3        EQU  H'0003'
T1CKIPPS4        EQU  H'0004'
T1CKIPPS5        EQU  H'0005'


;----- T1GPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
T1GPPS0          EQU  H'0000'
T1GPPS1          EQU  H'0001'
T1GPPS2          EQU  H'0002'
T1GPPS3          EQU  H'0003'
T1GPPS4          EQU  H'0004'
T1GPPS5          EQU  H'0005'
T1GPPS0          EQU  H'0000'
T1GPPS1          EQU  H'0001'
T1GPPS2          EQU  H'0002'
T1GPPS3          EQU  H'0003'
T1GPPS4          EQU  H'0004'
T1GPPS5          EQU  H'0005'


;----- CCP1PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
CCP1PPS0         EQU  H'0000'
CCP1PPS1         EQU  H'0001'
CCP1PPS2         EQU  H'0002'
CCP1PPS3         EQU  H'0003'
CCP1PPS4         EQU  H'0004'
CCP1PPS5         EQU  H'0005'
CCP1PPS0         EQU  H'0000'
CCP1PPS1         EQU  H'0001'
CCP1PPS2         EQU  H'0002'
CCP1PPS3         EQU  H'0003'
CCP1PPS4         EQU  H'0004'
CCP1PPS5         EQU  H'0005'


;----- PWM1ERSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
PWM1ERSPPS0      EQU  H'0000'
PWM1ERSPPS1      EQU  H'0001'
PWM1ERSPPS2      EQU  H'0002'
PWM1ERSPPS3      EQU  H'0003'
PWM1ERSPPS4      EQU  H'0004'
PWM1ERSPPS5      EQU  H'0005'
PWM1ERSPPS0      EQU  H'0000'
PWM1ERSPPS1      EQU  H'0001'
PWM1ERSPPS2      EQU  H'0002'
PWM1ERSPPS3      EQU  H'0003'
PWM1ERSPPS4      EQU  H'0004'
PWM1ERSPPS5      EQU  H'0005'


;----- CLCIN1PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
CLCIN1PPS0       EQU  H'0000'
CLCIN1PPS1       EQU  H'0001'
CLCIN1PPS2       EQU  H'0002'
CLCIN1PPS3       EQU  H'0003'
CLCIN1PPS4       EQU  H'0004'
CLCIN1PPS5       EQU  H'0005'
CLCIN1PPS0       EQU  H'0000'
CLCIN1PPS1       EQU  H'0001'
CLCIN1PPS2       EQU  H'0002'
CLCIN1PPS3       EQU  H'0003'
CLCIN1PPS4       EQU  H'0004'
CLCIN1PPS5       EQU  H'0005'


;----- U1RXPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
U1RXPPS0         EQU  H'0000'
U1RXPPS1         EQU  H'0001'
U1RXPPS2         EQU  H'0002'
U1RXPPS3         EQU  H'0003'
U1RXPPS4         EQU  H'0004'
U1RXPPS5         EQU  H'0005'
U1RXPPS0         EQU  H'0000'
U1RXPPS1         EQU  H'0001'
U1RXPPS2         EQU  H'0002'
U1RXPPS3         EQU  H'0003'
U1RXPPS4         EQU  H'0004'
U1RXPPS5         EQU  H'0005'


;----- U1CTSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
U1CTSPPS0        EQU  H'0000'
U1CTSPPS1        EQU  H'0001'
U1CTSPPS2        EQU  H'0002'
U1CTSPPS3        EQU  H'0003'
U1CTSPPS4        EQU  H'0004'
U1CTSPPS5        EQU  H'0005'
U1CTSPPS0        EQU  H'0000'
U1CTSPPS1        EQU  H'0001'
U1CTSPPS2        EQU  H'0002'
U1CTSPPS3        EQU  H'0003'
U1CTSPPS4        EQU  H'0004'
U1CTSPPS5        EQU  H'0005'


