GreatCowBASIC/DATFileGenerator/incfiles/p18F25Q71.inc
;----- CONFIG4 Options --------------------------------------------------
_BORV_VBOR_1P9_4     EQU  H'FF'; Brown-out Reset Voltage (VBOR) set to 1.9V
_BORV_VBOR_2P45_4    EQU  H'FE'; Brown-out Reset Voltage (VBOR) set to 2.45V
_BORV_VBOR_2P7_4     EQU  H'FD'; Brown-out Reset Voltage (VBOR) set to 2.7V
_BORV_VBOR_2P85_4    EQU  H'FC'; Brown-out Reset Voltage (VBOR) set to 2.85V
_ZCD_OFF_4           EQU  H'FF'; ZCD module is disabled. ZCD can be enabled by setting the ZCDSEN bit of ZCDCON
_ZCD_ON_4            EQU  H'FB'; ZCD module is always enabled; ZCDMD and ZCDSEN bits are ignored
_PPS1WAY_ON_4        EQU  H'FF'; PPSLOCKED bit can be cleared and set only once; PPS registers remain locked after one clear/set cycle
_PPS1WAY_OFF_4       EQU  H'F7'; PPSLOCKED bit can be set and cleared repeatedly (subject to the unlock sequence)
_STVREN_ON_4         EQU  H'FF'; Stack full/underflow will cause Reset
_STVREN_OFF_4        EQU  H'EF'; Stack full/underflow will not cause Reset
_LVP_ON_4            EQU  H'FF'; Low voltage programming enabled. MCLR/VPP pin function is MCLR. MCLRE configuration bit is ignored
_LVP_OFF_4           EQU  H'DF'; HV on MCLR/VPP must be used for programming
_DEBUG_OFF_4         EQU  H'FF'; Background Debugger disabled
_DEBUG_ON_4          EQU  H'BF'; Background Debugger enabled
_XINST_OFF_4         EQU  H'FF'; Extended Instruction Set and Indexed Addressing Mode disabled
_XINST_ON_4          EQU  H'7F'; Extended Instruction Set and Indexed Addressing Mode enabled

;----- CONFIG5 Options --------------------------------------------------
_WDTCPS_WDTCPS_0_5   EQU  H'E0'; Divider ratio 1:32
_WDTCPS_WDTCPS_1_5   EQU  H'E1'; Divider ratio 1:64
_WDTCPS_WDTCPS_2_5   EQU  H'E2'; Divider ratio 1:128
_WDTCPS_WDTCPS_3_5   EQU  H'E3'; Divider ratio 1:256
_WDTCPS_WDTCPS_4_5   EQU  H'E4'; Divider ratio 1:512
_WDTCPS_WDTCPS_5_5   EQU  H'E5'; Divider ratio 1:1024
_WDTCPS_WDTCPS_6_5   EQU  H'E6'; Divider ratio 1:2048
_WDTCPS_WDTCPS_7_5   EQU  H'E7'; Divider ratio 1:4096
_WDTCPS_WDTCPS_8_5   EQU  H'E8'; Divider ratio 1:8192
_WDTCPS_WDTCPS_9_5   EQU  H'E9'; Divider ratio 1:16384
_WDTCPS_WDTCPS_10_5  EQU  H'EA'; Divider ratio 1:32768
_WDTCPS_WDTCPS_11_5  EQU  H'EB'; Divider ratio 1:65536
_WDTCPS_WDTCPS_12_5  EQU  H'EC'; Divider ratio 1:131072
_WDTCPS_WDTCPS_13_5  EQU  H'ED'; Divider ratio 1:262144
_WDTCPS_WDTCPS_14_5  EQU  H'EE'; Divider ratio 1:524299
_WDTCPS_WDTCPS_15_5  EQU  H'EF'; Divider ratio 1:1048576
_WDTCPS_WDTCPS_16_5  EQU  H'F0'; Divider ratio 1:2097152
_WDTCPS_WDTCPS_17_5  EQU  H'F1'; Divider ratio 1:4194304
_WDTCPS_WDTCPS_18_5  EQU  H'F2'; Divider ratio 1:8388608
_WDTCPS_WDTCPS_19_5  EQU  H'F3'; Divider ratio 1:32
_WDTCPS_WDTCPS_20_5  EQU  H'F4'; Divider ratio 1:32
_WDTCPS_WDTCPS_21_5  EQU  H'F5'; Divider ratio 1:32
_WDTCPS_WDTCPS_22_5  EQU  H'F6'; Divider ratio 1:32
_WDTCPS_WDTCPS_23_5  EQU  H'F7'; Divider ratio 1:32
_WDTCPS_WDTCPS_24_5  EQU  H'F8'; Divider ratio 1:32
_WDTCPS_WDTCPS_25_5  EQU  H'F9'; Divider ratio 1:32
_WDTCPS_WDTCPS_26_5  EQU  H'FA'; Divider ratio 1:32
_WDTCPS_WDTCPS_27_5  EQU  H'FB'; Divider ratio 1:32
_WDTCPS_WDTCPS_28_5  EQU  H'FC'; Divider ratio 1:32
_WDTCPS_WDTCPS_29_5  EQU  H'FD'; Divider ratio 1:32
_WDTCPS_WDTCPS_30_5  EQU  H'FE'; Divider ratio 1:32
_WDTCPS_WDTCPS_31_5  EQU  H'FF'; Divider ratio 1:65536; software control of WDTPS
_WDTE_OFF_5          EQU  H'9F'; WDT Disabled; SWDTEN is ignored
_WDTE_SWDTEN_5       EQU  H'BF'; WDT enabled/disabled by SWDTEN bit
_WDTE_NSLEEP_5       EQU  H'DF'; WDT enabled while sleep=0, suspended when sleep=1; SWDTEN ignored
_WDTE_ON_5           EQU  H'FF'; WDT enabled regardless of sleep; SWDTEN is ignored

;----- CONFIG6 Options --------------------------------------------------
_WDTCWS_WDTCWS_0_6   EQU  H'F8'; window delay = 87.5; no software control; keyed access required
_WDTCWS_WDTCWS_1_6   EQU  H'F9'; window delay = 75 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_2_6   EQU  H'FA'; window delay = 62.5 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_3_6   EQU  H'FB'; window delay = 50 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_4_6   EQU  H'FC'; window delay = 37.5 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_5_6   EQU  H'FD'; window delay = 25 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_6_6   EQU  H'FE'; window always open (100%); no software control; keyed access required
_WDTCWS_WDTCWS_7_6   EQU  H'FF'; window always open (100%); software control; keyed access not required
_WDTCCS_LFINTOSC_6   EQU  H'C7'; WDT reference clock is the 31.0 kHz LFINTOSC
_WDTCCS_MFINTOSC_6   EQU  H'CF'; WDT reference clock is the 32kHz MFINTOSC output
_WDTCCS_SOSC_6       EQU  H'D7'; WDT reference clock is SOSC
_WDTCCS_SC_6         EQU  H'FF'; Software Control

;----- CONFIG7 Options --------------------------------------------------
_BBSIZE_BBSIZE_8192_7 EQU  H'3F'; Boot Block size is 8192 words
_BBSIZE_BBSIZE_8064_7 EQU  H'3E'; Boot Block size is 8064 words
_BBSIZE_BBSIZE_7936_7 EQU  H'3D'; Boot Block size is 7936 words
_BBSIZE_BBSIZE_7808_7 EQU  H'3C'; Boot Block size is 7808 words
_BBSIZE_BBSIZE_7680_7 EQU  H'3B'; Boot Block size is 7680 words
_BBSIZE_BBSIZE_7552_7 EQU  H'3A'; Boot Block size is 7552 words
_BBSIZE_BBSIZE_7424_7 EQU  H'39'; Boot Block size is 7424 words
_BBSIZE_BBSIZE_7296_7 EQU  H'38'; Boot Block size is 7296 words
_BBSIZE_BBSIZE_7168_7 EQU  H'37'; Boot Block size is 7168 words
_BBSIZE_BBSIZE_7040_7 EQU  H'36'; Boot Block size is 7040 words
_BBSIZE_BBSIZE_6912_7 EQU  H'35'; Boot Block size is 6912 words
_BBSIZE_BBSIZE_6784_7 EQU  H'34'; Boot Block size is 6784 words
_BBSIZE_BBSIZE_6656_7 EQU  H'33'; Boot Block size is 6656 words
_BBSIZE_BBSIZE_6528_7 EQU  H'32'; Boot Block size is 6528 words
_BBSIZE_BBSIZE_6400_7 EQU  H'31'; Boot Block size is 6400 words
_BBSIZE_BBSIZE_6272_7 EQU  H'30'; Boot Block size is 6272 words
_BBSIZE_BBSIZE_6144_7 EQU  H'2F'; Boot Block size is 6144 words
_BBSIZE_BBSIZE_6016_7 EQU  H'2E'; Boot Block size is 6016 words
_BBSIZE_BBSIZE_5888_7 EQU  H'2D'; Boot Block size is 5888 words
_BBSIZE_BBSIZE_5760_7 EQU  H'2C'; Boot Block size is 5760 words
_BBSIZE_BBSIZE_5632_7 EQU  H'2B'; Boot Block size is 5632 words
_BBSIZE_BBSIZE_5504_7 EQU  H'2A'; Boot Block size is 5504 words
_BBSIZE_BBSIZE_5376_7 EQU  H'29'; Boot Block size is 5376 words
_BBSIZE_BBSIZE_5248_7 EQU  H'28'; Boot Block size is 5248 words
_BBSIZE_BBSIZE_5120_7 EQU  H'27'; Boot Block size is 5120 words
_BBSIZE_BBSIZE_4992_7 EQU  H'26'; Boot Block size is 4992 words
_BBSIZE_BBSIZE_4864_7 EQU  H'25'; Boot Block size is 4864 words
_BBSIZE_BBSIZE_4736_7 EQU  H'24'; Boot Block size is 4736 words
_BBSIZE_BBSIZE_4608_7 EQU  H'23'; Boot Block size is 4608 words
_BBSIZE_BBSIZE_4480_7 EQU  H'22'; Boot Block size is 4480 words
_BBSIZE_BBSIZE_4352_7 EQU  H'21'; Boot Block size is 4352 words
_BBSIZE_BBSIZE_4224_7 EQU  H'20'; Boot Block size is 4224 words
_BBSIZE_BBSIZE_4096_7 EQU  H'1F'; Boot Block size is 4096 words
_BBSIZE_BBSIZE_3968_7 EQU  H'1E'; Boot Block size is 3968 words
_BBSIZE_BBSIZE_3840_7 EQU  H'1D'; Boot Block size is 3840 words
_BBSIZE_BBSIZE_3712_7 EQU  H'1C'; Boot Block size is 3712 words
_BBSIZE_BBSIZE_3584_7 EQU  H'1B'; Boot Block size is 3584 words
_BBSIZE_BBSIZE_3456_7 EQU  H'1A'; Boot Block size is 3456 words
_BBSIZE_BBSIZE_3328_7 EQU  H'19'; Boot Block size is 3328 words
_BBSIZE_BBSIZE_3200_7 EQU  H'18'; Boot Block size is 3200 words
_BBSIZE_BBSIZE_3072_7 EQU  H'17'; Boot Block size is 3072 words
_BBSIZE_BBSIZE_2944_7 EQU  H'16'; Boot Block size is 2944 words
_BBSIZE_BBSIZE_2816_7 EQU  H'15'; Boot Block size is 2816 words
_BBSIZE_BBSIZE_2688_7 EQU  H'14'; Boot Block size is 2688 words
_BBSIZE_BBSIZE_2560_7 EQU  H'13'; Boot Block size is 2560 words
_BBSIZE_BBSIZE_2432_7 EQU  H'12'; Boot Block size is 2432 words
_BBSIZE_BBSIZE_2304_7 EQU  H'11'; Boot Block size is 2304 words
_BBSIZE_BBSIZE_2176_7 EQU  H'10'; Boot Block size is 2176 words
_BBSIZE_BBSIZE_2048_7 EQU  H'F0'; Boot Block size is 2048 words
_BBSIZE_BBSIZE_1920_7 EQU  H'E0'; Boot Block size is 1920 words
_BBSIZE_BBSIZE_1792_7 EQU  H'D0'; Boot Block size is 1792 words
_BBSIZE_BBSIZE_1664_7 EQU  H'C0'; Boot Block size is 1664 words
_BBSIZE_BBSIZE_1536_7 EQU  H'B0'; Boot Block size is 1536 words
_BBSIZE_BBSIZE_1408_7 EQU  H'A0'; Boot Block size is 1408 words
_BBSIZE_BBSIZE_1280_7 EQU  H'90'; Boot Block size is 1280 words
_BBSIZE_BBSIZE_1152_7 EQU  H'80'; Boot Block size is 1152 words
_BBSIZE_BBSIZE_1024_7 EQU  H'70'; Boot Block size is 1024 words
_BBSIZE_BBSIZE_896_7 EQU  H'60'; Boot Block size is 896 words
_BBSIZE_BBSIZE_768_7 EQU  H'50'; Boot Block size is 768 words
_BBSIZE_BBSIZE_640_7 EQU  H'40'; Boot Block size is 640 words
_BBSIZE_BBSIZE_512_7 EQU  H'30'; Boot Block size is 512 words
_BBSIZE_BBSIZE_384_7 EQU  H'20'; Boot Block size is 384 words
_BBSIZE_BBSIZE_256_7 EQU  H'10'; Boot Block size is 256 words
_BBSIZE_BBSIZE_128_7 EQU  H'00'; Boot Block size is 128 words

;----- CONFIG8 Options --------------------------------------------------
_SAFSZ_SAFSZ_NONE_8  EQU  H'FF'; NONE
_SAFSZ_SAFSZ_128_8   EQU  H'FE'; Last 128 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_256_8   EQU  H'FC'; Last 256 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_384_8   EQU  H'F8'; Last 384 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_512_8   EQU  H'F0'; Last 512 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_640_8   EQU  H'E0'; Last 640 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_768_8   EQU  H'C0'; Last 768 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_896_8   EQU  H'80'; Last 896 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_1024_8  EQU  H'00'; Last 1024 words of PFM; self write operation depends on WRTSAF bit in CONFIG9

